Repository: starlight02/alma-onebot-bridge
Catalog: platforms/macos/AlmaOneBotBridge/Localizable.xcstrings
Source language: en
Languages: zh_hans

# 启动
source: Start
zh_hans: 启动

# 停止
source: Stop
zh_hans: 停止

# 重启
source: Restart
zh_hans: 重启

# 设置...
source: Settings…
zh_hans: 设置...

# 打开配置目录
source: Open Config Directory
zh_hans: 打开配置目录

# 打开运行日志
source: Open Run Log
zh_hans: 打开运行日志

# 关于 Alma Bridge
source: About Alma Bridge
zh_hans: 关于 Alma Bridge

# 退出 Alma Bridge
source: Quit Alma Bridge
zh_hans: 退出 Alma Bridge

# Bridge 服务
source: Bridge Service
zh_hans: Bridge 服务

# 监听端口
source: Listen Port
zh_hans: 监听端口

# Alma API 地址
source: Alma API URL
zh_hans: Alma API 地址

# 生成超时（秒）
source: Generation Timeout (s)
zh_hans: 生成超时（秒）

# 最大重试
source: Max Retries
zh_hans: 最大重试

# 重试延迟（毫秒）
source: Retry Delay (ms)
zh_hans: 重试延迟（毫秒）

# OneBot 超时（秒）
source: OneBot Timeout (s)
zh_hans: OneBot 超时（秒）

# AI 对话
source: AI Chat
zh_hans: AI 对话

# 模型覆盖
source: Model Override
zh_hans: 模型覆盖

# 留空使用默认
source: Leave empty for default
zh_hans: 留空使用默认

# 群聊历史条数
source: Group History Size
zh_hans: 群聊历史条数

# 思考提示
source: Thinking Indicator
zh_hans: 思考提示

# 留空则禁用
source: Leave empty to disable
zh_hans: 留空则禁用

# 在 QQ 中显示思考
source: Show Thinking in QQ
zh_hans: 在 QQ 中显示思考

# 安全与存储
source: Security & Storage
zh_hans: 安全与存储

# 访问令牌
source: Access Token
zh_hans: 访问令牌

# 禁用
source: Disabled
zh_hans: 禁用

# 认证已禁用；可信内网环境下可以接受。
source: Authentication disabled; acceptable on a trusted LAN.
zh_hans: 认证已禁用；可信内网环境下可以接受。

# 数据库路径
source: Database Path
zh_hans: 数据库路径

# People 目录
source: People Directory
zh_hans: People 目录

# 选择路径
source: Choose Path
zh_hans: 选择路径

# 选择
source: Select
zh_hans: 选择

# 取消
source: Cancel
zh_hans: 取消

# 保存
source: Save
zh_hans: 保存

# 放弃
source: Discard
zh_hans: 放弃

# 继续编辑
source: Keep Editing
zh_hans: 继续编辑

# 放弃更改？
source: Discard Changes?
zh_hans: 放弃更改？

# 保存失败
source: Save Failed
zh_hans: 保存失败

# 好
source: OK
zh_hans: 好

# 未知错误
source: Unknown error
zh_hans: 未知错误

# 端口必须在 1-65535 之间。
source: Port must be between 1 and 65535.
zh_hans: 端口必须在 1-65535 之间。

# 地址必须以 http:// 或 https:// 开头。
source: URL must start with http:// or https://.
zh_hans: 地址必须以 http:// 或 https:// 开头。

# 超时时间必须在 1-3600 秒之间。
source: Timeout must be between 1 and 3600 seconds.
zh_hans: 超时时间必须在 1-3600 秒之间。

# 重试次数必须在 0-10 之间。
source: Retries must be between 0 and 10.
zh_hans: 重试次数必须在 0-10 之间。

# 重试延迟必须在 0-600000 毫秒之间。
source: Retry delay must be between 0 and 600000 ms.
zh_hans: 重试延迟必须在 0-600000 毫秒之间。

# OneBot 超时必须在 1-600 秒之间。
source: OneBot timeout must be between 1 and 600 seconds.
zh_hans: OneBot 超时必须在 1-600 秒之间。

# 群聊历史条数必须是 0 或正整数。
source: Group history size must be 0 or a positive integer.
zh_hans: 群聊历史条数必须是 0 或正整数。

# 已保存
source: Saved
zh_hans: 已保存

# 已保存并热重载
source: Saved and hot-reloaded
zh_hans: 已保存并热重载

# 已保存，正在重启
source: Saved; restarting
zh_hans: 已保存，正在重启

# 未找到随 app 打包的桥接服务可执行文件，请使用 scripts/build-macos.sh 重新构建。
source: Bundled bridge executable not found. Rebuild with scripts/build-macos.sh.
zh_hans: 未找到随 app 打包的桥接服务可执行文件，请使用 scripts/build-macos.sh 重新构建。

# 缺少桥接服务
source: Bridge executable missing
zh_hans: 缺少桥接服务

# 端口已被占用。请关闭占用该端口的应用，或在设置中修改 Bridge 端口。
source: Port is already in use. Close the conflicting app or change the Bridge port in Settings.
zh_hans: 端口已被占用。请关闭占用该端口的应用，或在设置中修改 Bridge 端口。

# 启动失败：端口 %@ 被占用
source: Startup failed: port %@ is in use
zh_hans: 启动失败：端口 %@ 被占用

# Alma Bridge 无法启动
source: Alma Bridge could not start
zh_hans: Alma Bridge 无法启动

# 打开设置
source: Open Settings
zh_hans: 打开设置

# 正在启动：端口 %@
source: Starting: port %@
zh_hans: 正在启动：端口 %@

# 正在停止...
source: Stopping…
zh_hans: 正在停止...

# 正在重启...
source: Restarting…
zh_hans: 正在重启...

# 已停止
source: Stopped
zh_hans: 已停止

# 运行中：端口 %@
source: Running: port %@
zh_hans: 运行中：端口 %@

# 运行中，正在检查状态...
source: Running; checking status…
zh_hans: 运行中，正在检查状态...

# 运行中，健康检查失败
source: Running; health check failed
zh_hans: 运行中，健康检查失败

# 启动失败
source: Startup failed
zh_hans: 启动失败

# 加载配置失败：%@
source: Failed to load config: %@
zh_hans: 加载配置失败：%@

# 校验失败：%@
source: Validation failed: %@
zh_hans: 校验失败：%@

# 写入失败：%@
source: Write failed: %@
zh_hans: 写入失败：%@

# 桥接服务退出，状态码 %@。请查看 bridge.log。
source: Bridge exited with status %@. See bridge.log.
zh_hans: 桥接服务退出，状态码 %@。请查看 bridge.log。

# 启动桥接服务失败：%@
source: Failed to start bridge: %@
zh_hans: 启动桥接服务失败：%@

# 重载桥接服务配置失败：errno %@
source: Failed to hot-reload bridge config: errno %@
zh_hans: 重载桥接服务配置失败：errno %@

# 本地构建含未提交修改
source: local build with uncommitted changes
zh_hans: 本地构建含未提交修改

# 提交版本：%@
source: Commit: %@
zh_hans: 提交版本：%@

# 项目地址：
source: Project:
zh_hans: 项目地址：

# 作者：
source: Author:
zh_hans: 作者：

# 开源协议：
source: License:
zh_hans: 开源协议：

# 运行状态：%@
source: Status: %@
zh_hans: 运行状态：%@

# 监听端口：%@
source: Listen port: %@
zh_hans: 监听端口：%@

# 端口 %@ 已被占用。请关闭占用该端口的应用，或在设置中修改 Bridge 端口。
source: Port %@ is already in use. Close the conflicting app or change the Bridge port in Settings.
zh_hans: 端口 %@ 已被占用。请关闭占用该端口的应用，或在设置中修改 Bridge 端口。

# 当前配置端口：%@
source: Current configured port: %@
zh_hans: 当前配置端口：%@

# 正在启动
source: Starting
zh_hans: 正在启动

# 运行中
source: Running
zh_hans: 运行中

# 版本 %@
source: Version %@
zh_hans: 版本 %@

# 复制信息
source: Copy Info
zh_hans: 复制信息

# 无
source: None
zh_hans: 无

# 请检查配置项格式。
source: Check the configuration field formats.
zh_hans: 请检查配置项格式。
